// Задача 1.
// Определите количество ЧАСОВ которые прошли с 1970 года до текущего момента времени.
// Примечание: полученное значение округлите по правилам математики.

// let currentTime = Date.now()
// let time = new Date(0).getTime();
// let countHours = Math.round((currentTime - time) / (60 * 60 * 1000));
// console.log(countHours)


// Задача 2
// Какое количество дней прошло с начала 2000 года до текущего момент времени?
// Примечание: полученное значение округлите по правилам математики.

// let currentTime = Date.now()
// let time = new Date('2000-01-01').getTime();
// let countHours = Math.round((currentTime - time) / (24 * 60 * 60 * 1000));
// console.log(countHours)

// Задача 3. 
// Напишите функцию getWeekDay(), которая в зависимости от даты 
// (текущего момента времени) в консоль выводит день недели согласно результату

// function getWeekDay() {
//   const days = ['Воскресенье', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'];
//   let currentDate = new Date();
//   let day = currentDate.getDay();
//   console.log('Сегодня ' + days[day]);
// }
// getWeekDay();

// Задача 4. 
// Напишите функцию checkDate() которая в консоль отобразит количество дней до конца текущего месяца. 
// Примечание: инициализация дат должна быть внутри функции.

// НЕ ЗНАЮ
