// // Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа

// const number = +prompt("Введите число")
// console.log((number/100)*10)
// ----------------------------------------------------------


// Написать программу, которая получает два числа и выводит наименьшее

// const number = +prompt("Введите первое число")
// const number2 = +prompt("Введите второе число")
//   if (number === number2) {
//     console.log(number)
// } else if (number > number2) {
//     console.log(number2)
// } else 
// {   console.log(number)
// }
// ----------------------------------------------------------


// Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’

// const number = +prompt("Введите число")
//   if (number === 100) {
//     console.log("Число равно 100")
// } else if (number > 100) {
//     console.log("Число больше 100")
// } else 
// {   console.log("Число меньше 100")
// }
// ----------------------------------------------------------

// Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь несовершеннолетний.

// const username = prompt("Введите свое имя")
// const number = +prompt("Сколько Вам полных лет")
// if (number >= 18) {
//   console.log(`Hello, ${username}`)
// } else {
//   console.log(`Hi, ${username}`)
// }
